emacs.org
** Basic Config

This section contains the basic configuration for org-mode plus the configuration for Org agendas and capture templates

#+begin_src emacs-lisp

  (defun smv/org-mode-setup()
      (org-indent-mode)
      (variable-pitch-mode 1)
      (auto-fill-mode 0)
      (visual-line-mode 1)
      (smv/org-font-setup))


  (use-package org ;; org-mode, permit to take notes and other interesting stuff with a specific file extension
      :straight org-contrib
      :hook (org-mode . smv/org-mode-setup)
      :config
      (setq org-ellipsis " ▼:")
      (setq org-agenda-start-with-log-mode t)
      (setq org-log-done 'time)
      (setq org-log-into-drawer t)

      (setq org-agenda-files
              '("~/.org/todo.org"
              "~/.org/projects.org"))

      (setq org-todo-keywords
              '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
              (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))

      ;; easily move task to another header
      (setq org-refile-targets
              '(("archive.org" :maxlevel . 1)
              ("todo.org" :maxlevel . 1)
              ("projects.org" :maxlevel . 1)))

      ;; Save Org buffers after refiling!
      (advice-add 'org-refile :after 'org-save-all-org-buffers)

      (setq org-tag-alist
          '((:startgroup)
              ; Put mutually exclusive tags here
              (:endgroup)
              ("@school" . ?s)
              ("personal" . ?p)
              ("note" . ?n)
              ("idea" . ?i)))

      (setq org-agenda-custom-commands
          '(("d" "Dashboard"
          ((agenda "" ((org-deadline-warning-days 7)))
          (todo "TODO"
              ((org-agenda-overriding-header "All tasks")))))

          ("n" "Next Tasks"
          ((todo "NEXT"
              ((org-agenda-overriding-header "Next Tasks")))))

          ("st" "School Todos" tags-todo "+@school/TODO")
          ("sp" "School Projects" tags-todo "+@school/ACTIVE")
          
          ("pt" "Personal Todos" tags-todo "+personal/TODO")
          ("pl" "Personal Projects" tags-todo "+personal/ACTIVE")
          
          ;; Low-effort next actions
          ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
          ((org-agenda-overriding-header "Low Effort Tasks")
          (org-agenda-max-todos 20)
          (org-agenda-files org-agenda-files)))))

      (setq org-capture-templates ;; quickly add todos entries without going into the file
          `(("t" "Tasks")
          ("tt" "Task" entry (file+olp "~/.org/todo.org" "Tasks")
                  "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)))


      (smv/org-font-setup)
      (global-set-key (kbd "C-c a") 'org-agenda)
      (global-set-key (kbd "M-i") 'org-insert-item))


  ;; Install htmlize for source block hightlighting
  (use-package htmlize
    :after org)
#+end_src


** Auto rendering latex section

#+begin_src emacs-lisp
(use-package org-fragtog
    :hook (org-mode-hook . org-fragtog-mode))
#+end_src

** Presentation

Permet de faire des slides de presentation stylees dans le web sous emacs.

Apparemment il est possible de set la variable =(setq org-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/")= au lieu de telecharger le CDN.

#+begin_src emacs-lisp
(use-package ox-reveal)
(setq Org-Reveal-root "~/.config/emacs/reveal-js")
(setq Org-Reveal-title-slide nil)
#+end_src


** Nicer Heading

[[https://github.com/sabof/org-bullets][org-bullets]] permits to change the icon used for the different headings in org-mode.

I use also `org-num` to add numbers in front of my different headlines.

#+begin_src emacs-lisp

(use-package org-bullets ;; change the bullets in my org mode files
    :after org
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "☯" "○" "☯" "✸" "☯" "✿" "☯" "✜" "☯" "◆" "☯" "▶")))

;; Outline numbering for org mode
(use-package org-num
    :straight nil
    :load-path "lisp/"
    :after org
    :hook (org-mode . org-num-mode))
#+end_src


** Configure Babel Languages

To execute or export code in org-mode code blocks, you’ll need to set up org-babel-load-languages for each language you’d like to use. [[https://orgmode.org/worg/org-contrib/babel/languages.html][This page]] documents all of the languages that you can use with org-babel.

#+begin_src emacs-lisp
(with-eval-after-load 'org
  (org-babel-do-load-languages
      'org-babel-load-languages
      '((emacs-lisp . t)
      (python . t)))

  (push '("conf-unix" . conf-unix) org-src-lang-modes))
#+end_src


** Structure Templates

Org mode's [[https://orgmode.org/manual/Structure-Templates.html][structure template]] feature enables you to quickly insert code blocks into your Org files in combination with `org-tempo` by typing `<` followed by the template name like `el` or `py` and then press `TAB`. For example, to insert an empy `emacs-lisp` block below, you can type `<el` and press `TAB` to expand into such a block.

#+begin_src emacs-lisp
(with-eval-after-load 'org
;; This is needed as of Org 9.2
(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("ru" . "src rust")))
#+end_src


** Auto-tangle Configuration files

This snippets adds a hook to `org-mode` buffers so that efs/org-babel-tangle-config gets executed each time such a buffer gets saved. This function checks to see if the file being saved is the Emacs.org file you’re looking at right now, and if so, automatically exports the configuration here to the associated output files. Tangle is use to export org mode files into the configuration init.el file.

#+begin_src emacs-lisp

;; Automatically tangle our Emacs.org config file when we save it
(defun smv/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/.config/emacs/emacs.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'smv/org-babel-tangle-config)))

#+end_src



* Development

** Undo tree

Some day undo tree saved my self from losing my progress. It shows the changes history as a tree that you can freely explore

#+begin_src emacs-lisp
(use-package undo-tree
  :config
  (global-undo-tree-mode))
#+end_src

** Commenting Code

To help me comment code region quickly I set up this keyboard shortcut. The function used is a native emacs function.

#+begin_src emacs-lisp
(global-set-key (kbd "C-M-;") 'comment-region)
#+end_src


** Search project wide

Wgrep will permit to make grep buffers editable so that you can just modify the occurences of what you're looking for.
I use the built-in rgrep to do my search and replace so I'm binding it to =C-c r= .
#+begin_src emacs-lisp
(use-package wgrep)
(global-set-key (kbd "C-c r") 'rgrep)
#+end_src


** Direnv

direnv permit to load environment on fly. You will need to have a .envrc file, you could generate it with =lorri init= command or you can create one with the =use flake= command in it if you're using flakes.

To use this plugin you must install direnv using :  =nix-env -i direnv=. You can also install lorri the same way.

You could go to the lorri's website to grab some info [[https://github.com/nix-community/lorri][lorri website]]

#+begin_src emacs-lisp
(use-package direnv
  :config
  (direnv-mode))
#+end_src


** Languages

*** IDE Features with eglot-mode

Language server configuration for programming part.
eglot is installed by default so just chill and be happy with it.
I use some useful lsp packages with downloaded languages server for my programming journey.


**** Flymake

Flymake is the built-in inline diagnostic tool used by eglot.

#+begin_src emacs-lisp
  (use-package flymake
    :bind
    ("M-g f l" . flymake-show-project-diagnostics))

  (global-set-key (kbd "M-g e a") 'eglot-code-actions)
#+end_src


**** markdown-mode

I use this to make the eglot documentation more pretty

#+begin_src emacs-lisp
(use-package markdown-mode)
#+end_src


**** yasnippet

Useful snippets for quick programming

#+begin_src emacs-lisp
  (use-package yasnippet
      :config (yas-global-mode))

  (use-package auto-yasnippet
    :bind
    ("C-c C-y w" . aya-create)
    ("C-c C-y TA". aya-expand)
    ("C-c C-y SP". aya-expand-from-history)
    ("C-c C-y d" . aya-delete-from-history)
    ("C-c C-y c" . aya-clear-history)
    ("C-c C-y n" . aya-next-in-history)
    ("C-c C-y p" . aya-previous-in-history)
    ("C-c C-y s" . aya-persist-snippet)
    ("C-c C-y o" . aya-open-line))

#+end_src


*** Yaml-mode

Mode for yaml configuration files editing.

#+begin_src emacs-lisp
(use-package yaml-mode
:mode (("\\.yml\\'" . yaml-mode)
            ("\\.yaml\\'" . yaml-mode)
            ))
#+end_src



*** Nix mode

You know about nix ? This package manager... This mode permit to write file in the nix programming language.

#+begin_src emacs-lisp
  (use-package nix-ts-mode
    :mode ("\\.nix\\'" . nix-ts-mode))
#+end_src



*** Clojure

I love this programming language, just started to learn it.

#+begin_src emacs-lisp
(use-package cider)
(use-package clojure-ts-mode
  :mode ("\\.clj\\'" . clojure-ts-mode)
  :hook (clojure-ts-mode . eglot-ensure))
#+end_src

*** Web Programming

**** Emmet-mode

Emmet mode allors you to easily expand html and css abbreviations for instance if I type "p" then press control and j I get <p></p>. You can also use things like ~".container>section>(h1+p)"~.

#+begin_src emacs-lisp
(use-package emmet-mode)
#+end_src

