emacs.org
**** Web-mode

The useful web mode for programming.

#+begin_src emacs-lisp

(defun smv/web-mode-hook ()
"Hooks for Web mode."
(setq web-mode-markup-indent-offset 2)
(setq web-mode-css-indent-offset 2)
(setq web-mode-code-indent-offset 2)
(setq web-mode-enable-current-column-highlight t)
(setq web-mode-enable-current-element-highlight t)
(set (make-local-variable 'company-backends) '(company-css company-web-html company-yasnippet company-files))
)

(use-package web-mode
    :mode (("\\.html?\\'" . web-mode)
            ("\\.css?\\'" . web-mode)
            )
    :hook
    (web-mode . smv/web-mode-hook)
    (web-mode . emmet-mode)
    (web-mode . prettier-mode)
)

(add-hook 'web-mode-before-auto-complete-hooks
    '(lambda ()
    (let ((web-mode-cur-language
            (web-mode-language-at-pos)))
                (if (string= web-mode-cur-language "php")
            (yas-activate-extra-mode 'php-mode)
        (yas-deactivate-extra-mode 'php-mode))
                (if (string= web-mode-cur-language "css")
            (setq emmet-use-css-transform t)
        (setq emmet-use-css-transform nil)))))

#+end_src


**** JSX support

#+begin_src emacs-lisp
(use-package rjsx-mode
  :mode (("\\.js\\'" . rjsx-mode)
            ("\\.ts\\'" . rjsx-mode))
  :hook
  (rjsx-mode . emmet-mode)
  (rjsx-mode . prettier-mode))
#+end_src

**** prettier

Prettier automatically formats the code for you. I hate when it's in other modes but in web mode it's quite useful.

#+begin_src emacs-lisp
(use-package prettier)
#+end_src

*** TypeScript

You will need to install typescript-language-server with `npm install -g typescript-language-server typescript` .

#+begin_src emacs-lisp

(use-package typescript-mode
    :mode "\\.ts\\'"
    :config
    (setq typescript-indent-level 2))
#+end_src

*** PHP

Installing PHP

#+begin_src emacs-lisp
(use-package php-mode
:hook (php-mode . eglot-ensure)
:mode "\\.php\\'")
#+end_src


*** JAVA

You would have to set the path to JDTserver

#+begin_src emacs-lisp
(use-package eglot-java
    :after eglot)
#+end_src

*** R

#+begin_src emacs-lisp
;;(use-package ess)
#+end_src

*** RUST

#+begin_src emacs-lisp
(use-package rust-mode)

(use-package rust-ts-mode
  :hook (rust-ts-mode . eglot-ensure)
  :mode "\\.rs\\'"
  :bind-keymap
  ("C-c c" . rust-mode-map))

#+end_src

*** DART & FLUTTER

#+begin_src emacs-lisp
(use-package flutter)

(use-package dart-mode
    :hook (dart-mode . eglot-ensure)
    :mode "\\.dart\\'")
#+end_src


** Debugger configuration

#+begin_src emacs-lisp
(use-package dape)
#+end_src

** Company Mode

Company Mode provides a nicer in-buffer completion interface than completion-at-point which is more reminiscent of what you would expect from an IDE. We add a simple configuration to make the keybindings a little more useful (TAB now completes the selection and initiates completion at the current location if needed).

#+begin_src emacs-lisp
(use-package company
    :after eglot-mode
    :hook (eglot-managed-mode . company-mode)
    :bind
    (:map company-mode
        ("M-o" . company-manual-begin))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))

(use-package company-box
    :hook
    (company-mode . company-box-mode))

(use-package company-tabnine
    :config
    (add-to-list 'company-backends #'company-tabnine t))
#+end_src


** Docker Mode

Quickly manages [[https://github.com/Silex/docker.el][docker]] container directly inside emacs.

#+begin_src emacs-lisp
(use-package docker
    :bind ("C-c d" . docker))

(use-package dockerfile-mode)
#+end_src


** Github Copilot

Using github copilot has my pair programming assistant to finish my tasks more quickly.
Uncomment the commented parts only when you will finish installing copilot.

#+begin_src emacs-lisp
  (use-package copilot
    :straight (:host github :repo "copilot-emacs/copilot.el" :files ("*.el"))
    :ensure t)

  (setq copilot-node-executable "/opt/homebrew/bin/node")

  ;; keybindings that are active when copilot shows completions
  (define-key copilot-mode-map (kbd "C-M-<next>") #'copilot-next-completion)
  (define-key copilot-mode-map (kbd "C-M-<prior>") #'copilot-previous-completion)
  (define-key copilot-mode-map (kbd "C-M-<right>") #'copilot-accept-completion-by-word)
  (define-key copilot-mode-map (kbd "C-M-<return>") #'copilot-accept-completion-by-line)
  (define-key copilot-mode-map (kbd "C-M-<down>") 'copilot-accept-completion)

#+end_src


** Magit

[[https://magit.vc/][Magit]] is a git interface for emacs. It's very handy and fun to use.

#+begin_src emacs-lisp
(use-package magit
    :commands magit-status
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

#+end_src
